###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/6a7416c9-1f35-4d40-ae2b-8e57a813128a/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc-dev.aws_eip.nat_gateway will be created
  + resource "aws_eip" "nat_gateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = true
    }

  # module.vpc-dev.aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-igw"
          + "Owner" = "Matiram-Abhi"
        }
      + tags_all = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-igw"
          + "Owner" = "Matiram-Abhi"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc-dev.aws_nat_gateway.natgateway will be created
  + resource "aws_nat_gateway" "natgateway" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "Final project-dev-NAT-GATEWAY"
        }
      + tags_all             = {
          + "Name" = "Final project-dev-NAT-GATEWAY"
        }
    }

  # module.vpc-dev.aws_route_table.private_subnet_route will be created
  + resource "aws_route_table" "private_subnet_route" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "Final project-dev-private-route_table"
        }
      + tags_all         = {
          + "Name" = "Final project-dev-private-route_table"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc-dev.aws_route_table.public_route_table will be created
  + resource "aws_route_table" "public_route_table" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags_all         = (known after apply)
      + vpc_id           = (known after apply)
    }

  # module.vpc-dev.aws_route_table_association.private-route-table-association[0] will be created
  + resource "aws_route_table_association" "private-route-table-association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-dev.aws_route_table_association.private-route-table-association[1] will be created
  + resource "aws_route_table_association" "private-route-table-association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-dev.aws_route_table_association.public_route_table_association[0] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-dev.aws_route_table_association.public_route_table_association[1] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-dev.aws_route_table_association.public_route_table_association[2] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-dev.aws_route_table_association.public_route_table_association[3] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc-dev.aws_subnet.private_subnet[0] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-private-subnet-0"
          + "Owner" = "Matiram-Abhi"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-private-subnet-0"
          + "Owner" = "Matiram-Abhi"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-dev.aws_subnet.private_subnet[1] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-private-subnet-1"
          + "Owner" = "Matiram-Abhi"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-private-subnet-1"
          + "Owner" = "Matiram-Abhi"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-dev.aws_subnet.public_subnet[0] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-public-subnet-0"
          + "Owner" = "Matiram-Abhi"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-public-subnet-0"
          + "Owner" = "Matiram-Abhi"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-dev.aws_subnet.public_subnet[1] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-public-subnet-1"
          + "Owner" = "Matiram-Abhi"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-public-subnet-1"
          + "Owner" = "Matiram-Abhi"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-dev.aws_subnet.public_subnet[2] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-public-subnet-2"
          + "Owner" = "Matiram-Abhi"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-public-subnet-2"
          + "Owner" = "Matiram-Abhi"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-dev.aws_subnet.public_subnet[3] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-public-subnet-3"
          + "Owner" = "Matiram-Abhi"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-public-subnet-3"
          + "Owner" = "Matiram-Abhi"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc-dev.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-vpc"
          + "Owner" = "Matiram-Abhi"
        }
      + tags_all                             = {
          + "App"   = "Web"
          + "Env"   = "dev"
          + "Name"  = "Final project-dev-vpc"
          + "Owner" = "Matiram-Abhi"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnet_ids = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids  = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id             = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.vpc-dev.aws_eip.nat_gateway will be created%0A  + resource "aws_eip" "nat_gateway" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags_all             = (known after apply)%0A      + vpc                  = true%0A    }%0A%0A  # module.vpc-dev.aws_internet_gateway.igw will be created%0A  + resource "aws_internet_gateway" "igw" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-igw"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + tags_all = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-igw"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_nat_gateway.natgateway will be created%0A  + resource "aws_nat_gateway" "natgateway" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Name" = "Final project-dev-NAT-GATEWAY"%0A        }%0A      + tags_all             = {%0A          + "Name" = "Final project-dev-NAT-GATEWAY"%0A        }%0A    }%0A%0A  # module.vpc-dev.aws_route_table.private_subnet_route will be created%0A  + resource "aws_route_table" "private_subnet_route" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = ""%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = (known after apply)%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "Final project-dev-private-route_table"%0A        }%0A      + tags_all         = {%0A          + "Name" = "Final project-dev-private-route_table"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_route_table.public_route_table will be created%0A  + resource "aws_route_table" "public_route_table" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + instance_id                = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags_all         = (known after apply)%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_route_table_association.private-route-table-association[0] will be created%0A  + resource "aws_route_table_association" "private-route-table-association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_route_table_association.private-route-table-association[1] will be created%0A  + resource "aws_route_table_association" "private-route-table-association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_route_table_association.public_route_table_association[0] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_route_table_association.public_route_table_association[1] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_route_table_association.public_route_table_association[2] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_route_table_association.public_route_table_association[3] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_subnet.private_subnet[0] will be created%0A  + resource "aws_subnet" "private_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-private-subnet-0"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-private-subnet-0"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_subnet.private_subnet[1] will be created%0A  + resource "aws_subnet" "private_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.6.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-private-subnet-1"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-private-subnet-1"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_subnet.public_subnet[0] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-public-subnet-0"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-public-subnet-0"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_subnet.public_subnet[1] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-public-subnet-1"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-public-subnet-1"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_subnet.public_subnet[2] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-public-subnet-2"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-public-subnet-2"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_subnet.public_subnet[3] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1d"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-public-subnet-3"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-public-subnet-3"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.vpc-dev.aws_vpc.vpc will be created%0A  + resource "aws_vpc" "vpc" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.1.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = (known after apply)%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-vpc"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Env"   = "dev"%0A          + "Name"  = "Final project-dev-vpc"%0A          + "Owner" = "Matiram-Abhi"%0A        }%0A    }%0A%0APlan: 18 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + private_subnet_ids = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + public_subnet_ids  = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + vpc_id             = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @asitis1, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*